NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG21/EFR32BG21A020F512IM32.svd
        <register>
          <name>EXPORTCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x090</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F0F0F0F</resetMask>
          <fields>
            <field>
              <name>CLKOUTSEL0</name>
              <description>Clock Output Select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CLKOUT0 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK is clocking CLKOUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>EXPORTCLK is clocking CLKOUT0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking CLKOUT0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking CLKOUT0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking CLKOUT0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking CLKOUT0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking CLKOUT0</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking CLKOUT0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking CLKOUT0</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL1</name>
              <description>Clock Output Select 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CLKOUT1 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK is clocking CLKOUT1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>EXPORTCLK is clocking CLKOUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking CLKOUT1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking CLKOUT1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking CLKOUT1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking CLKOUT1</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking CLKOUT1</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking CLKOUT1</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking CLKOUT1</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL2</name>
              <description>Clock Output Select 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CLKOUT2 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK is clocking CLKOUT2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>EXPORTCLK is clocking CLKOUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking CLKOUT2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking CLKOUT2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking CLKOUT2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking CLKOUT2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking CLKOUT2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking CLKOUT2</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking CLKOUT2</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>EXPORTCLK Prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLLREFCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>DPLLREFCLK is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking DPLLREFCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking DPLLREFCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKIN0</name>
                  <description>CLKIN0 is clocking DPLLREFCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM01GRPACLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking EM01GRPACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking EM01GRPACLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking EM01GRPACLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking EM01GRPACLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM23GRPACLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking EM23GRPACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking EM23GRPACLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking EM23GRPACLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4GRPACLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x160</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking EM4GRPACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking EM4GRPACLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking EM4GRPACLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IADCCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EM01GRPACLK</name>
                  <description>EM01GRPACLK is clocking IADCCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking IADCCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking IADCCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDOG0CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking WDOG0CLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking WDOG0CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking WDOG0CLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLKDIV1024</name>
                  <description>HCLKDIV1024 is clocking WDOG0CLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDOG1CLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking WDOG1CLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking WDOG1CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking WDOG1CLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLKDIV1024</name>
                  <description>HCLKDIV1024 is clocking WDOG1CLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x240</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking RTCCCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking RTCCCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking RTCCCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRORTCCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x248</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking PRORTCCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking PRORTCCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking PRORTCCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADIOCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x280</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
